Repository: kapok-fwk/kapok-fwk
Catalog: src/Kapok.View/Resources/DataPage.*.resx
Languages: de_de

# AskRevertChangesDueToValidationErrorsDialog_GoBack_Description
source: .. so that I can fix the validation errors
de_de: ... um die Validierungsfehler zu beheben

# AskRevertChangesDueToValidationErrorsDialog_GoBack_Label
source: Go back
de_de: Bring mich zurück

# AskRevertChangesDueToValidationErrorsDialog_Message
source: There exist validation errors. Before you can go on, you need to fix the validation errors.
de_de: Es existieren Validierungsfehler

# AskRevertChangesDueToValidationErrorsDialog_RevertChanges_Description
source: Revert all my changes and go on
de_de: Verwerfe alle Änderungen und fahre fort...

# AskRevertChangesDueToValidationErrorsDialog_RevertChanges_Label
source: Revert changes
de_de: Änderungen verwerfen

# AskRevertChangesDueToValidationErrorsDialog_Title
source: Validation errors exist
de_de: Validierungsfehler bestehen

# CreateNewEntryCommand_Name
source: New
de_de: Neu

# DbUpdateConcurrencyException_MessageBox_Caption
source: Concurrency violation error
de_de: Parallelitätsverletzung

# DbUpdateConcurrencyException_MessageBox_Text
source: Update concurrency violation is encountered while saving to the database. A concurrency violation occurs when an unexpected number of rows are affected during save. This is usually because the data in the database has been modified since it was loaded into memory.
de_de: Eine Parallelitätsverletzung wurde beim Speichern in der Datenbank festgestellt. Eine Parallelitätsverletzung tritt auf, wenn während des Speicherns eine unerwartete Anzahl von Zeilen betroffen ist. Dies liegt normalerweise daran, dass die Daten in der Datenbank seit dem Laden in den Speicher geändert wurden.

# DbUpdateException_MessageBox_Caption
source: Database error
de_de: Datenbank Fehler

# DbUpdateException_MessageBox_Text
source: Database error: {0}
de_de: Datenbank Fehler: {0}

# DeleteEntryCommand_Name
source: Delete
de_de: Löschen

# DuplicatedEntryException_MessageBox_Caption
source: Duplicated entry exception
de_de: Doppelter Datensatz Ausnahme

# DuplicatedEntryException_MessageBox_Text
source: Duplicated entry exception: {0}
de_de: Doppelter Datensatz Ausnahme: {0}

source: Editable
de_de: Editierbar

# Editable_Description
source: Gets or sets the information if the list is editable. Note: This can be overridden by data in the TableData property. See IsEditable as well.
de_de: Gibt oder setzt die Information ob die Liste editiert werden darf. Hinweis: Dies kann überschrieben werden, z.B. durch die Strukturinformationen der Daten. Siehe auch: IsEditable

# EditModeToggleCommand_Name
source: Edit
de_de: Bearbeiten

source: General
de_de: Allgemein

source: Is editable
de_de: Ist editierbar

# IsEditable_Description
source: Identifies if the list is editable.
de_de: Gibt zurück ob die Tabelle bearbeitet werden kann.

source: Manage
de_de: Verwalten

source: Page
de_de: Seite

# RefreshCommand_Name
source: Refresh
de_de: Aktualisieren

# SaveDataCommand_Description
source: Save all current changes to the database
de_de: Speichere die aktuellen Änderungen in der Datenbank.

# SaveDataCommand_Name
source: Save
de_de: Speichern

# ValidationErrorExist_Message_Text
source: There exist entries with validation errors. You have to solve those validation errors first before you can continue.
de_de: Es bestehen Datensätze mit Validierungsfehler. Diese müssen erst behoben werden.

# ValidationErrorExist_Message_Title
source: Validation errors exist
de_de: Validierungsfehler bestehen
